app/controllers/charges_controller.rb

    def create
      # Amount in cents

      @amount = Event.find(params[:event]).price
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]