app/controllers/events_controller.rb

  def show
    @creator = User.find(@event.creator_id)
    event_attending = EventAttendee.where(event_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."event_id" = $1  [["event_id", 9]]

  def edit
    @event = Event.find(params[:id].to_i)
    @user_creator = User.find(@event.creator_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # user = User.find(session[:user]['id'])
    event_attendee = EventAttendee.new
    @event = Event.new(event_params)

    @event.creator = current_user

    event_attendee.event = @event
    event_attendee.attendee = current_user

    respond_to do |format|
      if @event.save
        event_attendee.save!
---
INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "event_attendees" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 7], ["attendee_id", 1], ["created_at", "2018-05-08 10:53:35.953427"], ["updated_at", "2018-05-08 10:53:35.953427"]]

  def suscribe
    attending = EventAttendee.new
    event = Event.find(params[:id])
    attending.event = event
    attending.attendee = User.find(current_user.id)
    if attending.valid?
      attending.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "event_attendees" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 9], ["attendee_id", 3], ["created_at", "2018-05-08 18:50:41.544087"], ["updated_at", "2018-05-08 18:50:41.544087"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "Un évènement de test"], ["updated_at", "2018-05-08 12:50:53.494790"], ["id", 8]]

  def destroy
    @event_attendee = EventAttendee.find_by(event_id: params[:id])
    @event_attendee.destroy
---
SELECT  "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."event_id" = $1 LIMIT $2  [["event_id", 8], ["LIMIT", 1]]
DELETE FROM "event_attendees" WHERE "event_attendees"."id" = $1  [["id", 2]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 4]]