app/controllers/users_controller.rb

  def show
    if params[:id]
      @user = User.find(params[:id])
      @event_attended = EventAttendee.where(attendee_id: params['id'])
      @events = []
      if @event_attended != []
        @event_attended.each do |e|
          @events.push(Event.find(e.event_id))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."attendee_id" = $1  [["attendee_id", 2]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]